#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-mz9FJjVnpFsPkEbQ" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/57522d44-b112-4d49-97fc-d4f3a3ad65cf/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-mz9FJjVnpFsPkEbQ

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 5s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-alert-prs-slack-webhook-url_A0CA0B2B will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-alert-prs-slack-webhook-url_A0CA0B2B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1B9B597E will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1B9B597E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8FE34BA4 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8FE34BA4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token_6F32D8A9 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-gh-token_6F32D8A9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key-passphrase_64B68B77 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key-passphrase_64B68B77" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key_CE85BAE4 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key_CE85BAE4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-staging-profile-id_7A0DF91E will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-staging-profile-id_7A0DF91E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-npm-token_1689F3C4 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-npm-token_1689F3C4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-nuget-api-key_404500D3 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-nuget-api-key_404500D3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-twine-password_C2DE8DEF will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-twine-password_C2DE8DEF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-twine-username_CFC0E61E will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-twine-username_CFC0E61E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE" {
      - created_at      = "2023-01-27 16:12:18 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - updated_at      = "2023-01-27 16:12:18 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748" {
      - created_at      = "2023-01-27 16:12:28 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:GH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:28 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828" {
      - created_at      = "2023-01-27 16:12:06 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "GO_GITHUB_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:06 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4" {
      - created_at      = "2023-01-27 16:12:27 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "PROJEN_GITHUB_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:27 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB" {
      - created_at      = "2023-01-27 16:12:10 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY" -> null
      - updated_at      = "2023-01-27 16:12:10 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A" {
      - created_at      = "2023-01-27 16:12:07 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - updated_at      = "2023-01-27 16:12:07 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303" {
      - created_at      = "2023-01-27 16:12:05 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:MAVEN_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_PASSWORD" -> null
      - updated_at      = "2023-01-27 16:12:05 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8" {
      - created_at      = "2023-01-27 16:12:22 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_STAGING_PROFILE_ID" -> null
      - updated_at      = "2023-01-27 16:12:22 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691" {
      - created_at      = "2023-01-27 16:12:23 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:MAVEN_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_USERNAME" -> null
      - updated_at      = "2023-01-27 16:12:23 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D" {
      - created_at      = "2023-01-27 16:12:16 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:16 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B" {
      - created_at      = "2023-01-27 16:12:09 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2023-01-27 16:12:09 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E" {
      - created_at      = "2023-01-27 16:12:19 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2023-01-27 16:12:19 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9" {
      - created_at      = "2023-01-27 16:12:26 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "cdktf-provider-mongodbatlas:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value)
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2023-01-27 16:12:26 +0000 UTC" -> null
    }

  # github_branch_protection.cdktf-provider-mongodbatlas_repository-setup_main-protection_C19EA731 will be created
  + resource "github_branch_protection" "cdktf-provider-mongodbatlas_repository-setup_main-protection_C19EA731" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-mongodbatlas"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be destroyed
  # (because github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 is not in configuration)
  - resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOI2liXc4CAYbG" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-mongodbatlas" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "Validate PR title",
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_issue_label.cdktf-provider-mongodbatlas-go_repository-setup_automerge-label_6A04EB24 will be created
  + resource "github_issue_label" "cdktf-provider-mongodbatlas-go_repository-setup_automerge-label_6A04EB24" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-mongodbatlas_repository-setup_automerge-label_ADD15693 will be created
  + resource "github_issue_label" "cdktf-provider-mongodbatlas_repository-setup_automerge-label_ADD15693" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F will be destroyed
  # (because github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"fe3d71f328dc5358198ceee733c56b8b070025048609a01c9dd94ca8fee0639e\"" -> null
      - id         = "cdktf-provider-mongodbatlas:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-mongodbatlas" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-mongodbatlas/labels/automerge" -> null
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 will be destroyed
  # (because github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"bcb94fba4b2bae95ccb49cb920a777c14ba6621fad0e3b69b23b018f135580cb\"" -> null
      - id         = "cdktf-provider-mongodbatlas-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-mongodbatlas-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-mongodbatlas-go/labels/automerge" -> null
    }

  # github_repository.cdktf-provider-mongodbatlas-go_repo_73B8D506 will be created
  + resource "github_repository" "cdktf-provider-mongodbatlas-go_repo_73B8D506" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "CDK for Terraform Go provider bindings for mongodbatlas."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-mongodbatlas-go"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "mongodbatlas",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository.cdktf-provider-mongodbatlas_repo_F46B7D14 will be created
  + resource "github_repository" "cdktf-provider-mongodbatlas_repo_F46B7D14" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for mongodbatlas."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-mongodbatlas"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "mongodbatlas",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 will be destroyed
  # (because github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 is not in configuration)
  - resource "github_repository" "repospartners_cdktfprovidermongodbatlas_repo_B439CDB5" {
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Prebuilt Terraform CDK (cdktf) provider for mongodbatlas." -> null
      - etag                   = "W/\"47d03d83132032dab81cab9c158211121678fc6a2fcd1fb344c5448fee8fbae5\"" -> null
      - full_name              = "cdktf/cdktf-provider-mongodbatlas" -> null
      - git_clone_url          = "git://github.com/cdktf/cdktf-provider-mongodbatlas.git" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - homepage_url           = "https://cdk.tf" -> null
      - html_url               = "https://github.com/cdktf/cdktf-provider-mongodbatlas" -> null
      - http_clone_url         = "https://github.com/cdktf/cdktf-provider-mongodbatlas.git" -> null
      - id                     = "cdktf-provider-mongodbatlas" -> null
      - is_template            = false -> null
      - name                   = "cdktf-provider-mongodbatlas" -> null
      - node_id                = "R_kgDOI2liXQ" -> null
      - private                = false -> null
      - repo_id                = 594109021 -> null
      - ssh_clone_url          = "git@github.com:cdktf/cdktf-provider-mongodbatlas.git" -> null
      - svn_url                = "https://github.com/cdktf/cdktf-provider-mongodbatlas" -> null
      - topics                 = [
          - "cdk",
          - "cdktf",
          - "mongodbatlas",
          - "pre-built-provider",
          - "provider",
          - "terraform",
          - "terraform-cdk",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }

  # github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 will be destroyed
  # (because github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 is not in configuration)
  - resource "github_repository" "repospartners_cdktfprovidermongodbatlasgo_repo_718CC063" {
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "CDK for Terraform Go provider bindings for mongodbatlas." -> null
      - etag                   = "W/\"ebea4a33c9b1883e3e9c366d0b3de70f63dcbe260938fc4b8e2bb428ce39ccc8\"" -> null
      - full_name              = "cdktf/cdktf-provider-mongodbatlas-go" -> null
      - git_clone_url          = "git://github.com/cdktf/cdktf-provider-mongodbatlas-go.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - homepage_url           = "https://cdk.tf" -> null
      - html_url               = "https://github.com/cdktf/cdktf-provider-mongodbatlas-go" -> null
      - http_clone_url         = "https://github.com/cdktf/cdktf-provider-mongodbatlas-go.git" -> null
      - id                     = "cdktf-provider-mongodbatlas-go" -> null
      - is_template            = false -> null
      - name                   = "cdktf-provider-mongodbatlas-go" -> null
      - node_id                = "R_kgDOI2liUA" -> null
      - private                = false -> null
      - repo_id                = 594109008 -> null
      - ssh_clone_url          = "git@github.com:cdktf/cdktf-provider-mongodbatlas-go.git" -> null
      - svn_url                = "https://github.com/cdktf/cdktf-provider-mongodbatlas-go" -> null
      - topics                 = [
          - "cdk",
          - "cdktf",
          - "mongodbatlas",
          - "pre-built-provider",
          - "provider",
          - "terraform",
          - "terraform-cdk",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }

  # github_repository_webhook.cdktf-provider-mongodbatlas-go_repository-setup_slack-webhook_A27AE275 will be created
  + resource "github_repository_webhook" "cdktf-provider-mongodbatlas-go_repository-setup_slack-webhook_A27AE275" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktf-provider-mongodbatlas_repository-setup_slack-webhook_BB90F959 will be created
  + resource "github_repository_webhook" "cdktf-provider-mongodbatlas_repository-setup_slack-webhook_BB90F959" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA will be destroyed
  # (because github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA is not in configuration)
  - resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA" {
      - active     = true -> null
      - events     = [
          - "issues",
        ] -> null
      - id         = "398580582" -> null
      - repository = "cdktf-provider-mongodbatlas" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-mongodbatlas/hooks/398580582" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value)
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE will be destroyed
  # (because github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE is not in configuration)
  - resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE" {
      - active     = true -> null
      - events     = [
          - "issues",
        ] -> null
      - id         = "398580580" -> null
      - repository = "cdktf-provider-mongodbatlas-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-mongodbatlas-go/hooks/398580580" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value)
          - url          = (sensitive value)
        }
    }

  # github_team_repository.cdktf-provider-mongodbatlas-go_repository-setup_managing-team_1843C9C7 will be created
  + resource "github_team_repository" "cdktf-provider-mongodbatlas-go_repository-setup_managing-team_1843C9C7" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-mongodbatlas-go"
      + team_id    = "6602018"
    }

  # github_team_repository.cdktf-provider-mongodbatlas_repository-setup_managing-team_0EB784FF will be created
  + resource "github_team_repository" "cdktf-provider-mongodbatlas_repository-setup_managing-team_0EB784FF" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-mongodbatlas"
      + team_id    = "6602018"
    }

  # github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A will be destroyed
  # (because github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A is not in configuration)
  - resource "github_team_repository" "repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A" {
      - etag       = "W/\"4d67a3a639bb3aaac55e79d0cf990a83c0da557d68dc1236065d7fa8a71c9595\"" -> null
      - id         = "6602018:cdktf-provider-mongodbatlas" -> null
      - permission = "admin" -> null
      - repository = "cdktf-provider-mongodbatlas" -> null
      - team_id    = "6602018" -> null
    }

  # github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904 will be destroyed
  # (because github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904 is not in configuration)
  - resource "github_team_repository" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904" {
      - etag       = "W/\"2c4f8d985918542c88d9c95db11c3dc3bca035cdb16b7aeb8fbddac8e0618c8e\"" -> null
      - id         = "6602018:cdktf-provider-mongodbatlas-go" -> null
      - permission = "admin" -> null
      - repository = "cdktf-provider-mongodbatlas-go" -> null
      - team_id    = "6602018" -> null
    }

Plan: 22 to add, 0 to change, 22 to destroy.

Changes to Outputs:
  + providerRepos                        = [
      + "github_repository.cdktf-provider-mongodbatlas_repo_F46B7D14.ssh_clone_url",
    ]
  - repospartners_providerRepos_017B2065 = [
      - "git@github.com:cdktf/cdktf-provider-mongodbatlas.git",
    ] -> null
::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*